---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueMfpModifier
source: html/31987271-0eee-81f5-af79-356a4298ea2d.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueMfpModifier Property

The property labeled "Translucency Weight" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string OpaqueMfpModifier { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.